Revit 2024 API
RepeatingReferenceSource Properties
The RepeatingReferenceSource type exposes the following members.
Properties
Name | Description
DimensionCount
 The dimension count of the repeating reference array.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
RepeatingReferenceSource Class
Autodesk.Revit.DB Namespace